#+TITLE: Organize My Life In Plain Text
#+AUTHOR: 胡琛

* Work 
  
** Tasks
    
** Projects
      
*** NEXT KMeans Modeling in Stock Market [2/4]
    SCHEDULED: <2017-11-25 周六 15:20>
    :LOGBOOK:
    CLOCK: [2017-11-29 周三 15:12]--[2017-11-29 周三 15:37] =>  0:25
    CLOCK: [2017-11-24 周五 15:31]--[2017-11-24 周五 15:56] =>  0:25
    CLOCK: [2017-11-23 周四 14:05]--[2017-11-23 周四 14:30] =>  0:25
    CLOCK: [2017-11-22 周三 16:47]--[2017-11-22 周三 17:03] =>  0:16
    :END:
    
    - [X] 投稿期刊与期刊要求
    - [X] 文章概览
    - [-] 主体内容
      - [X] 内容框架 
      - [ ] 代码准备
      - [ ] 图片准备
      - [ ] 参考文献准备
    - [ ] 投稿

* Personal
  
** Tasks 
     
*** WAITING Tensorflow 实现 RNN                                     :WAITING:
    :LOGBOOK:
    CLOCK: [2017-11-20 周一 21:46]--[2017-11-20 周一 22:11] =>  0:25
    :END:
*** NEXT 遗传算法
    SCHEDULED: <2017-11-21 周二 14:45>
    :PROPERTIES:
    :Effort:   60
    :END:
    :LOGBOOK:
    CLOCK: [2017-11-21 周二 14:47]--[2017-11-21 周二 15:09] =>  0:22
    CLOCK: [2017-11-20 周一 13:55]--[2017-11-20 周一 14:20] =>  0:25
    CLOCK: [2017-11-20 周一 13:25]--[2017-11-20 周一 13:50] =>  0:25
    CLOCK: [2017-11-19 周日 11:27]--[2017-11-19 周日 11:52] =>  0:25
    CLOCK: [2017-11-19 周日 10:54]--[2017-11-19 周日 11:19] =>  0:25
    CLOCK: [2017-11-19 周日 10:22]--[2017-11-19 周日 10:47] =>  0:25
    :END:
    
*** WAITING 纯 =Numpy= 实现神经网络                                 :WAITING:
    
*** DONE 投资计划可行性报告
    CLOSED: [2017-11-25 周六 13:31] SCHEDULED: <2017-11-25 周六 11:30>
    :LOGBOOK:
    CLOCK: [2017-11-25 周六 11:28]--[2017-11-25 周六 11:53] =>  0:25
    :END:
    
*** DONE Review of RTS code Version 2
    CLOSED: [2017-11-29 周三 15:01]
    :LOGBOOK:
    CLOCK: [2017-11-25 周六 13:36]--[2017-11-25 周六 14:01] =>  0:25
    :END:
    
** Projects
   
*** WAITING PyTorch 学习                                            :WAITING:
    :LOGBOOK:
    CLOCK: [2017-11-07 周二 15:44]--[2017-11-07 周二 16:09] =>  0:25
    CLOCK: [2017-11-07 周二 15:14]--[2017-11-07 周二 15:39] =>  0:25
    CLOCK: [2017-11-07 周二 14:44]--[2017-11-07 周二 15:09] =>  0:25
    :END:
   
*** WAITING VNPY 学习                                               :WAITING:
*** NEXT 台湾大学李宏毅 -- Machine Learning [3/22]
    SCHEDULED: <2017-11-25 周六 14:00>
    :LOGBOOK:
    CLOCK: [2017-11-27 周一 13:08]--[2017-11-27 周一 13:33] =>  0:25
    CLOCK: [2017-11-25 周六 14:39]--[2017-11-25 周六 14:55] =>  0:16
    CLOCK: [2017-11-25 周六 14:07]--[2017-11-25 周六 14:32] =>  0:25
    CLOCK: [2017-11-16 周四 10:35]--[2017-11-16 周四 11:00] =>  0:25
    CLOCK: [2017-11-13 周一 16:15]--[2017-11-13 周一 16:40] =>  0:25
    CLOCK: [2017-11-13 周一 15:46]--[2017-11-13 周一 16:12] =>  0:26
    CLOCK: [2017-11-13 周一 14:42]--[2017-11-13 周一 15:07] =>  0:25
    CLOCK: [2017-11-13 周一 14:11]--[2017-11-13 周一 14:36] =>  0:25
    CLOCK: [2017-11-13 周一 11:01]--[2017-11-13 周一 11:26] =>  0:25
    CLOCK: [2017-11-13 周一 10:29]--[2017-11-13 周一 10:54] =>  0:25
    CLOCK: [2017-11-09 周四 15:34]--[2017-11-09 周四 15:59] =>  0:25
    CLOCK: [2017-11-09 周四 14:55]--[2017-11-09 周四 15:20] =>  0:25
    CLOCK: [2017-11-09 周四 14:24]--[2017-11-09 周四 14:49] =>  0:25
    CLOCK: [2017-11-06 周一 08:39]--[2017-11-06 周一 09:04] =>  0:25
    CLOCK: [2017-11-03 周五 13:38]--[2017-11-03 周五 14:03] =>  0:25
    CLOCK: [2017-11-03 周五 13:06]--[2017-11-03 周五 13:31] =>  0:25
    CLOCK: [2017-11-02 周四 11:05]--[2017-11-02 周四 11:30] =>  0:25
    :END:
   
    - [X] What is Machine Learning
   
    - [X] Neural Network

    - [X] Backpropagation -- Be careful of notation and chain rules 

    - [ ] Theano-DNN -- Due to the dropout of DNN, I'm trying Pytorch

    - [ ] Tips For Training DNN

    - [ ] Neural Network with Memory

    - [ ] Theano-RNN

    - [ ] Training RNN

    - [ ] Intro to Structured Learning

    - [ ] Structured Linear Model

    - [ ] Structured SVM

    - [ ] Sequence Labeling Problem

    - [ ] SVM Structure

    - [ ] Learning with Hidden Info

    - [ ] Graphical Model Gibbs Sampling

    - [ ] Markov Login Network

    - [ ] Human Language Processing

    - [ ] Language Modeling

    - [ ] Caffe

    - [ ] Deep Reinforcement Learning

    - [ ] Unsupervised Learning

    - [ ] Attention-based Model
*** NEXT 动手学深度学习
    SCHEDULED: <2017-11-23 周四 10:00>
    :LOGBOOK:
    CLOCK: [2017-12-01 周五 13:18]--[2017-12-01 周五 13:43] =>  0:25
    CLOCK: [2017-11-23 周四 10:03]--[2017-11-23 周四 10:28] =>  0:25
    :END:
*** NEXT 资金管理 [1/5]
    :LOGBOOK:
    CLOCK: [2017-11-28 周二 15:25]
    :END:
    
    - [X] 确定平台
      - 掘金
    - [ ] 测试性的回测策略
    - [ ] 可用于实盘模拟的策略
    - [ ] 实盘模拟
    - [ ] 实盘
    
* Miscellaneous
* Habit

** NEXT TradeBlazer 日常策略系列
   SCHEDULED: <2017-11-11 周六 09:30>
   :LOGBOOK:
   CLOCK: [2017-11-11 周六 09:57]--[2017-11-11 周六 10:22] =>  0:25
   CLOCK: [2017-11-11 周六 09:21]--[2017-11-11 周六 09:46] =>  0:25
   CLOCK: [2017-11-09 周四 10:35]--[2017-11-09 周四 10:50] =>  0:15
   CLOCK: [2017-11-09 周四 10:00]--[2017-11-09 周四 10:25] =>  0:25
   CLOCK: [2017-11-09 周四 09:25]--[2017-11-09 周四 09:50] =>  0:25
   CLOCK: [2017-11-07 周二 10:24]--[2017-11-07 周二 10:49] =>  0:25
   CLOCK: [2017-11-07 周二 09:32]--[2017-11-07 周二 09:57] =>  0:25
   CLOCK: [2017-11-07 周二 09:01]--[2017-11-07 周二 09:26] =>  0:25
   CLOCK: [2017-11-05 周日 10:07]--[2017-11-05 周日 10:32] =>  0:25
   CLOCK: [2017-11-04 周六 13:25]--[2017-11-04 周六 13:38] =>  0:13
   CLOCK: [2017-11-04 周六 12:49]--[2017-11-04 周六 13:14] =>  0:25
   CLOCK: [2017-11-04 周六 12:02]--[2017-11-04 周六 12:27] =>  0:25
   CLOCK: [2017-11-01 周三 20:03]--[2017-11-01 周三 20:17] =>  0:14
   CLOCK: [2017-11-01 周三 19:33]--[2017-11-01 周三 19:58] =>  0:25
   :END:
   
*** WAITING 反应趋势交易系统 (RTS)                                  :WAITING:
    
*** WAITING 自适应交易系统                                          :WAITING:

** NEXT 掘金量化日常策略系列
